{ 
    ".authorMsg": "- Dịch sang tiếng Ý: <a href='https://chat.openai.com'>ChatGPT</a>", 
    "GUI hiệu chỉnh DualShock": "GUI hiệu chỉnh DualShock", 
    " Trình duyệt không được hỗ trợ . Vui lòng sử dụng trình duyệt web có hỗ trợ WebHID (ví dụ: Chrome).": "Trình duyệt không được hỗ trợ. Vui lòng sử dụng trình duyệt web có hỗ trợ WebHID (ví dụ: Chrome). " 
    , "Kết nối DualShock 4 hoặc bộ điều khiển DualSense với máy tính của bạn và nhấn Kết nối.", 
    "Kết nối": "Kết nối", 
    "Đã kết nối với:": "Đã kết nối với:", 
    "Ngắt kết nối": "Đã ngắt kết nối", 
    "Hiệu chỉnh tâm thanh": "Hiệu chỉnh tâm thanh", 
    "Hiệu chỉnh phạm vi thanh": "Hiệu chỉnh phạm vi thanh", 
    "Các phần bên dưới không hữu ích, chỉ là một số thông tin gỡ lỗi hoặc lệnh thủ công": 
    "Trạng thái NVS": "Trạng thái NVS", 
    "Không xác định": "Không xác định", 
    "Nút gỡ lỗi": "Nút gỡ lỗi", 
    "Truy vấn trạng thái NVS": "Truy vấn trạng thái NVS", 
    "Mở khóa NVS": "Mở khóa NVS", 
    "Khóa NVS": "Khóa NVS", 
    "Hiệu chỉnh nhanh tâm que (OLD)": "Hiệu chỉnh nhanh tâm que (OLD)", 
    "Hiệu chỉnh tâm que": "Hiệu chỉnh tâm que", 
    "Chào mừng": "Chào mừng", 
    " Bước 1": "Bước 1", 
    "Bước 2": "Bước 2", 
    "Bước 3": "Bước 3", 
    "Bước 4": "Bước 4", 
    "Đã hoàn thành": "Đã hoàn thành", 
    "Chào mừng bạn đến với thuật sĩ hiệu chỉnh tâm thanh!": "Chào mừng bạn đến với trình hướng dẫn hiệu chỉnh tâm thanh! " , 
    "Công cụ này sẽ hướng dẫn bạn căn giữa lại các cần analog của bộ điều khiển. Hướng dẫn bạn căn chỉnh lại cần điều khiển. Nó bao gồm bốn bước và yêu cầu bạn di chuyển cả hai cây gậy theo một hướng nhất định rồi thả chúng ra. ", 
    "Xin lưu ý rằng, <i>khi quá trình hiệu chỉnh đang chạy, bạn không thể hủy nó</i>. Không đóng trang này hoặc ngắt kết nối bộ điều khiển của bạn cho đến khi hoàn tất.": "Xin lưu ý rằng, <i>. khi quá trình hiệu chuẩn đang chạy thì không thể hủy được</i>. <i>Bạn sẽ không thể hủy được nữa</i>. Không đóng trang này hoặc ngắt kết nối bộ điều khiển cho đến khi hoàn tất. ", 
    "Nhấn <b>Bắt đầu</b> để bắt đầu hiệu chỉnh.": "Nhấn <b>Bắt đầu</b> để bắt đầu hiệu chỉnh.", "Nhấn <b>Bắt đầu</b> để bắt đầu hiệu chỉnh.": "Nhấn <b>Bắt đầu</b> để bắt đầu hiệu chỉnh. ", 
    "Hãy di chuyển cả hai cây gậy đến <b>góc trên cùng bên trái</b> và thả chúng ra.":"Khi các que quay trở lại chính giữa, nhấn <b>Tiếp tục</b>.": 
    "Khi các que quay trở lại chính giữa, nhấn <b>Tiếp tục</b>.": "Khi các que quay lại ở giữa, nhấn <b>Tiếp tục</b>." Khi bạn quay lại giữa, nhấn <b>Tiếp tục</b>.", 
    "Vui lòng di chuyển cả hai thanh đến <b>góc trên cùng bên phải </b> và thả chúng ra." " 
    Vui lòng di chuyển cả hai cây gậy đến <b>góc dưới bên trái</b> và thả chúng ra.": " 
    "Vui lòng di chuyển cả hai cây gậy đến <b>góc dưới bên phải</b> và thả chúng ra." : "Di chuyển cả hai que đến <b>góc dưới bên phải</b> và quay lại.", 
    "Đã hoàn tất hiệu chuẩn thành công!": "Đã hoàn tất hiệu chuẩn thành công!",
    "Tiếp theo": "Tiếp theo", 
    "Định tâm lại bộ điều khiển. ", 
    "Vui lòng không đóng cửa sổ này và không ngắt kết nối bộ điều khiển của bạn. ": "Vui lòng không đóng cửa sổ này và không ngắt kết nối bộ điều khiển của bạn. Không đóng hoặc ngắt kết nối bộ điều khiển.", 
    "Hiệu chỉnh phạm vi": "Hiệu chỉnh phạm vi", 
    "<b>Bộ điều khiển hiện đang lấy mẫu dữ liệu!</b>": "<b>Bộ điều khiển hiện đang lấy mẫu dữ liệu! 
    "Xoay các que từ từ để bao phủ toàn bộ phạm vi. Nhấn \"Xong\" khi hoàn thành.": "Xoay các que từ từ để bao phủ toàn bộ phạm vi. Nhấn \"Xong\" khi hoàn thành.": "Xoay các que từ từ để bao gồm toàn bộ phạm vi Nhấn \"Xong\" khi hoàn thành." ", 
    "Done": "Xong", 
    "Xin chào, cảm ơn bạn đã sử dụng phần mềm này.": "Xin chào, cảm ơn bạn đã sử dụng phần mềm này. ", 
    "Nếu bạn thấy nó hữu ích và muốn ủng hộ nỗ lực của tôi, vui lòng": "Nếu bạn thấy nó hữu ích và muốn hỗ trợ nỗ lực của tôi, vui lòng", 
    "mua cho tôi một ly cà phê " : "Mua cho tôi một ly cà phê", 
    "! :)": "! :)", 
    "Bạn có gợi ý hoặc vấn đề gì không? Hãy gửi tin nhắn cho tôi qua email hoặc discord.": "Bạn có gợi ý hoặc vấn đề gì không? Gửi tin nhắn cho tôi qua email hoặc discord.": "Bạn có gợi ý gì không? hoặc vấn đề? Hãy gửi cho tôi một tin nhắn qua email hoặc bất hòa." Hãy cho chúng tôi biết qua email hoặc discord. ", 
    "Chúc mừng!": "Chúc mừng! ", 
    "Hỗ trợ dự án này": "Hỗ trợ dự án này", 

    "không xác định": "không xác định", 
    "bản gốc": "bản gốc", 
    "bản sao": "bản sao", 
    "đã khóa": "đã khóa", 
    "đã mở khóa": "unlocked", 
    "error": "error", " 
    Build Date": "build date", 
    "HW Version": "HW version", 
    "SW Version": "SW version", 
    "Device Type": "Loại thiết bị", 

    "Hoàn thành hiệu chỉnh phạm vi": "Hoàn thành hiệu chỉnh phạm vi", 
    "Hiệu chỉnh phạm vi không thành công: ": "Hiệu chỉnh phạm vi không thành công:", 
    "Không thể mở khóa NVS": "Mở khóa NVS " Không thể 
    khóa lại NVS": "Không thể khóa lại NVS ", 
    "Lỗi 1": "Lỗi 1", 
    "Lỗi 2": "Lỗi 2", 
    "Lỗi 3": "Lỗi 3", 
    "Hiệu chỉnh que không thành công: ": "Hiệu chỉnh thanh không thành công:", 
    "Hoàn thành hiệu chỉnh thanh": "Hoàn thành hiệu chỉnh thanh", 
    "Khóa NVS không thành công: ": "Khóa NVS không thành công:", 
    "Mở khóa NVS không thành công: ": "Mở khóa NVS không thành công:" , 
    "Vui lòng chỉ kết nối một bộ điều khiển tại một thời điểm.": "Vui lòng chỉ kết nối một bộ điều khiển tại một thời điểm. ", 
    "Sony DualShock 4 V1":"Sony DualShock 4 V1", 
    "Sony DualShock 4 V2": "Sony DualShock 4 V2", 
    "Sony DualSense": "Sony DualSense", 
    "Sony DualSense Edge": "Sony DualSense Edge", 
    "Thiết bị được kết nối không hợp lệ: ": "Thiết bị được kết nối không hợp lệ:", 
    "Việc hiệu chỉnh DualSense Edge hiện không được hỗ trợ.": "DualSense Hiệu chỉnh cạnh hiện không được hỗ trợ.", 
    "Thiết bị này có vẻ là bản sao DS4. Tất cả các chức năng đều bị tắt." " 
    Lỗi: ": "Lỗi:", 
    "Tên của tôi khi xử lý Discord là: the_al", 
    "Đang khởi tạo. ..": "Đang khởi tạo..." ,
    "Đang lưu hiệu chuẩn...": "Đang lưu hiệu chuẩn...", 
    "Lấy mẫu...": "Đang lấy mẫu...", 
    "Đang hiệu chuẩn": "Đang hiệu chuẩn", 
    "Bắt đầu": "Bắt đầu", 
    "Tiếp tục": "Tiếp tục", 
    "Bạn có thể kiểm tra hiệu chuẩn bằng", 
    "Chúc một ngày tốt lành :)": "Chúc một ngày tốt lành :) ", 
    "Chào mừng đến với Hiệu chuẩn GUI": "Chào mừng đến với GUI hiệu chỉnh", 
    "Chỉ một số điều cần biết trước khi bạn có thể bắt đầu:": 
    "Trang web này không liên kết với Sony, PlayStation & co." : "Trang web này không liên kết với Sony hoặc PlayStation .", 
    "Dịch vụ này được cung cấp mà không có bảo hành. Bạn phải tự chịu rủi ro khi sử dụng." 
    "Hãy giữ pin bên trong của bộ điều khiển . được kết nối và đảm bảo nó được sạc đầy. Nếu pin hết trong khi hoạt động, bộ điều khiển sẽ bị hỏng và không thể sử dụng được.": "Kết nối pin bên trong của bộ điều khiển và đảm bảo rằng pin đã được sạc đầy trong khi hoạt động. bị hỏng và không thể sử dụng được.", " 
    Trước khi thực hiện hiệu chỉnh vĩnh viễn, hãy thử hiệu chuẩn tạm thời để đảm bảo rằng mọi thứ đều hoạt động tốt.": "Thực hiện hiệu chuẩn tạm thời để đảm bảo mọi thứ đều hoạt động bình thường trước khi thực hiện hiệu chuẩn vĩnh viễn. ", 
    "Đã hiểu": "Đã hiểu", 
    "Phiên bản": "Phiên bản", 

    "Câu hỏi thường gặp": "Câu hỏi thường gặp", 
    "Đóng": "Đóng", 
    "Chào mừng bạn đến với phần Câu hỏi thường gặp bên dưới! tìm câu trả lời cho một số câu hỏi thường gặp nhất về trang web này. Nếu bạn có bất kỳ câu hỏi nào khác hoặc cần hỗ trợ thêm, vui lòng liên hệ trực tiếp với tôi! Phản hồi và câu hỏi của bạn luôn được chào đón!: "Chào mừng, Câu hỏi thường gặp. Hãy truy cập. phần này! Dưới đây bạn sẽ tìm thấy câu trả lời cho những câu hỏi thường gặp nhất về trang web này. Nếu bạn có bất kỳ thắc mắc nào khác hoặc cần hỗ trợ thêm, vui lòng liên hệ trực tiếp với chúng tôi. Phản hồi và câu hỏi luôn được chào đón! ", 
    "Nó hoạt động như thế nào?": "Nó hoạt động như thế nào?", "Nó hoạt động như thế nào?": "Nó hoạt động như thế nào? ", 
    "Hậu trường, trang web này là đỉnh cao của một năm nỗ lực tận tâm trong việc thiết kế ngược bộ điều khiển DualShock để giải trí/sở thích từ một anh chàng ngẫu nhiên trên internet.", "Đằng sau hậu trường, trang web này là đỉnh cao của một năm nỗ lực tận tâm trong việc thiết kế bộ điều khiển DualShock kỹ thuật đảo ngược để giải trí/sở thích từ một anh chàng ngẫu nhiên trên internet. Kết quả của một năm cống hiến cho kỹ thuật đảo ngược bộ điều khiển DualShock nhằm giải trí và sở thích của những người ngẫu nhiên. ", 
    "Thông qua": "thông qua", 
    "nghiên cứu này": "nghiên cứu này", 
    ", người ta phát hiện ra rằng có tồn tại một số lệnh không có giấy tờ trên bộ điều khiển DualShock có thể được gửi qua USB và được sử dụng trong quá trình lắp ráp tại nhà máy. các lệnh được gửi đi, bộ điều khiển bắt đầu hiệu chỉnh lại các cần analog.":", người ta phát hiện ra rằng bộ điều khiển DualShock có một số lệnh không có tài liệu được gửi qua USB và được sử dụng trong quá trình lắp ráp tại nhà máy. Khi các lệnh này được gửi, bộ điều khiển ", 
    " Mặc dù trọng tâm chính của nghiên cứu này ban đầu không tập trung vào hiệu chỉnh lại, rõ ràng là một dịch vụ cung cấp khả năng này có thể mang lại lợi ích to lớn cho nhiều cá nhân. Và do đó, chúng tôi ở đây ": "Mặc dù trọng tâm chính của nghiên cứu này ban đầu không phải là hiệu chỉnh lại, nhưng rõ ràng là dịch vụ cung cấp chức năng này có thể mang lại lợi ích to lớn cho nhiều người. Kết quả là tôi ở đây.
    "Hiệu chỉnh có còn hiệu quả khi chơi trò chơi trên PS4/PS5 không?": "Việc hiệu chỉnh có còn hiệu quả trong khi chơi trò chơi trên PS4/PS5 không?", 
    "Có, nếu bạn đánh dấu vào hộp kiểm \"Viết các thay đổi vĩnh viễn vào bộ điều khiển \". Trong trong trường hợp đó, quá trình hiệu chuẩn sẽ được flash trực tiếp trong chương trình cơ sở của bộ điều khiển. Điều này đảm bảo rằng nó vẫn ở đúng vị trí bất kể nó được kết nối với bảng điều khiển nào.": "Có, hãy chọn hộp kiểm 'Ghi các thay đổi vĩnh viễn vào bộ điều khiển'. Tôi sẽ thực hiện. Trong trường hợp đó, hiệu chuẩn sẽ được flash trực tiếp vào phần sụn của bộ điều khiển. Điều này đảm bảo rằng nó vẫn ở đúng vị trí bất kể bảng điều khiển được kết nối với nó. ", 
    "Đây có phải là dịch vụ được chứng thực chính thức không?": "Đây có phải là dịch vụ được chứng thực chính thức không?": "Đây có phải là dịch vụ được chứng thực chính thức không? ", 
    "Không, dịch vụ này chỉ đơn giản là sản phẩm của một người đam mê DualShock.": "Không, dịch vụ này chỉ đơn giản là sản phẩm của một người đam mê DualShock.", "Không, dịch vụ này chỉ đơn giản là sản phẩm của một người đam mê DualShock." ", 
    "Trang web này có phát hiện xem bộ điều khiển có phải là bản sao không?": "Trang web này có phát hiện xem bộ điều khiển có phải là bản sao không?": "Trang web này có phát hiện xem bộ điều khiển có phải là bản sao không?" ", 
    "Có, hiện tại chỉ có DualShock4. Điều này xảy ra do tôi vô tình mua một số bản sao, dành thời gian xác định sự khác biệt và thêm chức năng này để ngăn chặn sự lừa dối trong tương lai.": "Có, hiện tại chỉ có DualShock4. Điều này là do tôi đã vô tình mua một số bản sao, dành chút thời gian để xác định sự khác biệt và thêm tính năng này để tránh những hiểu lầm trong tương lai. : 
    "Thật không may, dù sao thì các bản sao cũng không thể được hiệu chỉnh vì chúng chỉ sao chép hoạt động của DualShock4 trong khi chơi trò chơi thông thường chứ không phải tất cả các chức năng không có giấy tờ." DualShock4 trong khi chơi trò chơi bình thường, không phải tất cả các chức năng không có giấy tờ." Điều này là do họ chỉ sao chép hoạt động của DualShock 4 trong quá trình chơi trò chơi thông thường chứ không phải tất cả các tính năng không có giấy tờ của nó. ", 
    "Nếu bạn muốn mở rộng chức năng phát hiện này sang DualSense, vui lòng gửi cho tôi một DualSense giả và bạn sẽ thấy nó sau vài tuần." : "Nếu bạn muốn mở rộng chức năng phát hiện này sang DualSense, vui lòng gửi cho tôi một DualSense giả và bạn sẽ thấy nó trong vài tuần nữa." làm ơn. Nó sẽ được thực hiện trong một vài tuần. ", 
    "Dự định phát triển những gì?": "Dự định phát triển những gì?": "Dự định phát triển những gì?": "Dự định phát triển những gì? ", 

    "Tôi duy trì hai danh sách việc cần làm riêng biệt cho dự án này, mặc dù mức độ ưu tiên vẫn chưa được thiết lập." : "Tôi duy trì hai danh sách việc cần làm riêng biệt cho dự án này, mặc dù mức độ ưu tiên vẫn chưa được thiết lập.", “Tôi duy trì hai danh sách việc cần làm riêng biệt cho dự án này, mặc dù mức độ ưu tiên vẫn chưa được thiết lập.” " , 
    "Danh sách đầu tiên nói về việc tăng cường hỗ trợ cho bộ điều khiển DualShock4 và DualSense:", 
    "Triển khai hiệu chỉnh trình kích hoạt L2/R2." : "Triển khai hiệu chỉnh trình kích hoạt L2/R2. ", 
    "Cải thiện việc phát hiện các bản sao, đặc biệt có lợi cho những người muốn mua bộ điều khiển đã qua sử dụng với sự đảm bảo về tính xác thực." : "Cải thiện việc phát hiện các bản sao, đặc biệt có lợi cho những người đang tìm mua bộ điều khiển đã qua sử dụng với sự đảm bảo về tính xác thực. ", 
    "Nâng cao giao diện người dùng (ví dụ: cung cấp thông tin bổ sung về bộ điều khiển)": " 
    Thêm hỗ trợ cho việc hiệu chỉnh lại IMU.", "Nâng cao giao diện người dùng (ví dụ: cung cấp thông tin bổ sung về bộ điều khiển)": "Thêm hỗ trợ cho việc hiệu chỉnh lại IMU. ", 
    "Ngoài ra,khám phá khả năng khôi phục bộ điều khiển DualShock không hoạt động (có thể thảo luận thêm trên Discord dành cho các bên quan tâm). 
    ", "Danh sách thứ hai chứa các bộ điều khiển mới mà tôi mong muốn hỗ trợ:": ", 
    "DualSense Edge": "DualSense Edge",
    "DualShock 3": "DualShock 3", 
    "Bộ điều khiển XBox": "Bộ điều khiển Xbox", 
    "Mỗi nhiệm vụ trong số này thể hiện cả sự quan tâm to lớn lẫn sự đầu tư đáng kể về thời gian. Để cung cấp ngữ cảnh, việc hỗ trợ bộ điều khiển mới thường cần 6-12 tháng sử dụng đầy đủ -nghiên cứu theo thời gian, cùng với một sự may mắn.": "Mỗi nhiệm vụ này đều rất thú vị và cần đầu tư nhiều thời gian. Để cung cấp bối cảnh, việc hỗ trợ bộ điều khiển mới thường cần 6 đến 12 tháng nghiên cứu toàn thời gian và với một chút may mắn," 
    , "Tôi thích dịch vụ này, nó đã giúp tôi! Tôi có thể đóng góp bằng cách nào?", 
    "Tôi rất vui khi biết rằng bạn thấy điều này hữu ích! Nếu bạn muốn đóng góp, đây là một "Tôi rất vui khi biết bạn thấy điều này hữu ích! Nếu bạn muốn đóng góp, đây là một số cách bạn có thể giúp tôi:", 
    " Hãy cân nhắc thực hiện": "Cân nhắc", 
    "quyên góp": "Quyên góp", 
    " để hỗ trợ những nỗ lực kỹ thuật đảo ngược được thúc đẩy bởi caffeine vào đêm khuya của tôi." ", 
    " Gửi cho tôi một bộ điều khiển mà bạn muốn thêm vào (gửi email cho tôi cho tổ chức).", 
    "Dịch trang web này sang ngôn ngữ của bạn": " Dịch trang web này sang ngôn ngữ của bạn", 
    ", để giúp đỡ nhiều người như bạn hơn!": ", tới giúp đỡ nhiều người như bạn hơn! ", 
    "Trang web này sử dụng phân tích để cải thiện dịch vụ.": "Trang web này sử dụng phân tích để cải thiện dịch vụ.", "Trang web này sử dụng phân tích để cải thiện dịch vụ.": "Trang web này sử dụng phân tích để cải thiện dịch vụ. ", 

    "Mô hình bảng": "Mô hình bảng", 
    "Tính năng này là thử nghiệm.": "Tính năng này là thử nghiệm. ", 
    "Vui lòng cho tôi biết nếu model bo mạch của bộ điều khiển của bạn không được phát hiện chính xác." : "Vui lòng cho tôi biết nếu model bo mạch của bộ điều khiển của bạn không được phát hiện chính xác. ", 
    "Phát hiện model bo mạch nhờ": "Cảm ơn bạn đã phát hiện model bo mạch", 
    "Vui lòng kết nối thiết bị bằng cáp USB.": "Vui lòng kết nối thiết bị bằng cáp USB. ", 
    "Bộ điều khiển DualSense này có chương trình cơ sở lỗi thời." : "Bộ điều khiển DualSense này có chương trình cơ sở lỗi thời. ", 
    "Vui lòng cập nhật chương trình cơ sở và thử lại.": "Vui lòng cập nhật chương trình cơ sở và thử lại.", "Vui lòng cập nhật chương trình cơ sở và thử lại.": "Vui lòng cập nhật chương trình cơ sở và thử lại. ", 
    "Thông tin cần điều khiển": "Thông tin cần điều khiển", 
    "Err R:": "Lỗi bên phải:", 
    "Err L:": "Lỗi bên trái:", 
    "Kiểm tra vòng tròn": "Kiểm tra vòng tròn", 

    "Tôi có thể đặt lại không hiệu chuẩn vĩnh viễn so với hiệu chuẩn trước đó?": "", 
    "Không.": "", 
    "Bạn có thể ghi đè hiệu chuẩn vĩnh viễn không?": "", 
    "Có. Chỉ cần thực hiện hiệu chuẩn vĩnh viễn khác.": "",
    "Phần mềm này có giải quyết được tình trạng trôi dạt không?": "", 
    "Stickdrift là do lỗi vật lý; cụ thể là bụi bẩn, chiết áp bị mòn hoặc trong một số trường hợp là lò xo bị mòn.": "", 
    "Phần mềm này sẽ không tự khắc phục tình trạng trôi dạt của thanh nếu bạn đã trải qua điều đó. Điều sẽ hữu ích là đảm bảo (các) cần điều khiển mới sẽ hoạt động bình thường sau khi thay thế (các) cần điều khiển cũ để hoạt động tốt..": "",
    "Tôi nhận thấy một số bộ điều khiển lấy ra khỏi hộp có hiệu chuẩn ban đầu kém hơn so với khi tôi hiệu chỉnh lại chúng. Đặc biệt đúng đối với tính tuần hoàn của bộ điều khiển SCUF có lớp vỏ độc đáo.": "", 
    "(Dualsense) Sẽ cập nhật hiệu chỉnh thiết lập lại chương trình cơ sở chứ?" : "", 
    "Sau khi hiệu chỉnh phạm vi, cần điều khiển luôn ở trong các góc.": "", 
    "Sự cố này xảy ra do bạn đã nhấp vào \"Xong\" ngay sau khi bắt đầu hiệu chỉnh phạm vi.": "", 
    "Vui lòng đọc phần hướng dẫn.": "", 
    "Bạn phải xoay cần điều khiển trước khi nhấn \"Xong\".": "", 
    "Đảm bảo chạm vào các cạnh của khung cần điều khiển và xoay chậm, tốt nhất là theo từng hướng - theo chiều kim đồng hồ và ngược chiều kim đồng hồ.": "", 
    "Chỉ sau khi thực hiện xong, bạn mới nhấp vào \"Xong\".": "", 

    "Đã lưu thay đổi thành công": "", 
    "Lỗi khi lưu thay đổi:": "" , 
    "Lưu thay đổi vĩnh viễn": "", 
    "Khởi động lại bộ điều khiển": "" , 

    "Thông tin bộ điều khiển" 
    : " ", "Thông tin gỡ lỗi": "", 
    "Nút gỡ lỗi" 
    : "", "Phần mềm": "", 
    "Phần cứng": " ", 

    "Ngày xây dựng FW": "", 
    "Loại FW": 
    "", "Dòng FW": " 
    ", "Phiên bản FW 
    ": "", "Cập nhật FW": "", 
    "Thông tin cập nhật FW": " ", 
    " SBL Phiên bản FW": "", 
    "Phiên bản Venom FW": "", " 
    Phiên bản Spider FW": "", 
    "Phiên bản FW trên bàn di chuột": "", 

    "Số sê-ri": "", 
    "ID duy nhất của MCU": "" , 
    "PCBA ID": "", 
    "Mã vạch pin": "", 
    "Mã vạch bên trái VCM": "", 
    "Mã vạch bên phải VCM": "", 
    "Mẫu HW": "", 
    "ID bàn di chuột": "", 
    "Địa chỉ Bluetooth": "", 
    "Hiển thị tất cả": "", 

    "": "" 
}
