{
    ".authorMsg": "- Dịch Tiếng Việt <a href='https://github.com/'>bởi ShuShiPS</a>",
    "DualShock Calibration GUI": "Giao diện hiệu chuẩn DualShock",
    "Unsupported browser. Please use a web browser with WebHID support (e.g. Chrome).": "Trình duyệt không được hỗ trợ. Vui lòng sử dụng trình duyệt web có hỗ trợ WebHID (ví dụ: Chrome) .",
    "Connect a DualShock 4 or a DualSense controller to your computer and press Connect.": "Kết nối bộ điều khiển DualShock 4 hoặc DualSense với máy tính của bạn và nhấn nút Kết nối.",
    "Connect": "Kết nối",
    "Connected to:": "Đã kết nối với:",
    "Disconnect": "Ngắt kết nối",
    "Calibrate stick center": "Hiệu chỉnh tâm",
    "Calibrate stick range": "Hiệu chỉnh phạm vi",
    "Sections below are not useful, just some debug infos or manual commands": "Các phần bên dưới không hữu ích, chỉ có một số thông tin gỡ lỗi hoặc lệnh thủ công",
    "NVS Status": "Trạng thái NVS",
    "Unknown": "Không rõ",
    "Debug buttons": "Nút gỡ lỗi",
    "Query NVS status": "Truy vấn trạng thái NVS",
    "NVS unlock": "Mở khóa NVS",
    "NVS lock": "Khóa NVS",
    "Fast calibrate stick center (OLD)": "Hiệu chỉnh tâm (cũ)",
    "Stick center calibration": "Hiệu chỉnh tâm",
    "Welcome": "Chào mừng",
    "Step 1": "Bước 1",
    "Step 2": "Bước 2",
    "Step 3": "Bước 3",
    "Step 4": "Bước 4",
    "Completed": "Hoàn thành",
    "Welcome to the stick center-calibration wizard!": "Chào mừng bạn đến với Trình hướng dẫn hiệu chỉnh Stick Center - ShuShiPS",
    "This tool will guide you in re-centering the analog sticks of your controller. It consists in four steps: you will be asked to move both sticks in a direction and release them.": "Công cụ này sẽ hướng dẫn bạn định vị lại tâm của thanh. Bao gồm bốn bước: Bạn sẽ được yêu cầu di chuyển cả hai cần điều khiển về một hướng và thả cần điều khiển.",
    "Please be aware that, <i>once the calibration is running, it cannot be canceled</i>. Do not close this page or disconnect your controller until is completed.": "Xin lưu ý rằng，<i>khi hiệu chuẩn đã được bắt đầu, nó sẽ không thể bị hủy</i>。Vui lòng không đóng trang này hoặc ngắt kết nối bộ điều khiển của bạn cho đến khi bạn hoàn thành.",
    "Press <b>Start</b> to begin calibration.": "Nhấn <b>Bắt đầu</b> để bắt đầu hiệu chỉnh.",
    "Please move both sticks to the <b>top-left corner</b> and release them.": "Vui lòng di chuyển hai cần điều khiển đến <b>góc trên bên trái</b> và thả cần điều khiển ra.",
    "When the sticks are back in the center, press <b>Continue</b>.": "Khi cần điều khiển trở về vị trí chính giữa, nhấn <b>Tiếp tục</b>.",
    "Please move both sticks to the <b>top-right corner</b> and release them.": "Vui lòng di chuyển hai cần điều khiển đến <b>góc trên bên phải</b> và thả cần điều khiển ra.",
    "Please move both sticks to the <b>bottom-left corner</b> and release them.": "Vui lòng di chuyển hai cần điều khiển đến <b>góc dưới bên trái</b> và thả cần điều khiển ra.",
    "Please move both sticks to the <b>bottom-right corner</b> and release them.": "Vui lòng di chuyển hai cần điều khiển đến <b>góc dưới bên phải</b> và thả cần điều khiển ra.",
    "Calibration completed successfully!": "Hiệu chuẩn hoàn tất, thành công!",
    "Next": "Bước tiếp theo",
    "Recentering the controller sticks. ": "Đặt lại vị trí trung tâm thanh. ",
    "Please do not close this window and do not disconnect your controller. ": "Vui lòng không đóng cửa sổ này hoặc ngắt kết nối bộ điều khiển. ",
    "Range calibration": "Hiệu chỉnh phạm vi",
    "<b>The controller is now sampling data!</b>": "<b>Tay cầm hiện đang lấy mẫu dữ liệu！</b>",
    "Rotate the sticks slowly to cover the whole range. Press \"Done\" when completed.": "Xoay cần điều khiển từ từ để bao phủ toàn bộ khu vực hình tròn. Khi hoàn tất, nhấn \"Xong\".",
    "Done": "Hoàn thành",
    "Hi, thank you for using this software.": "Chào bạn, cảm ơn bạn đã sử dụng phần mềm này。",
    "If you're finding it helpful and you want to support my efforts, feel free to": "Nếu bạn thấy điều này hữu ích và muốn hỗ trợ công việc của tôi, bạn luôn được chào đón！",
    "buy me a coffee":  "Hãy mua cho tôi một chai nút chuối",
    "! :)": "! :)",
    "Do you have any suggestion or issue? Drop me a message via email or discord.": "Bạn có gợi ý hay vấn đề gì không? Hãy gửi cho tôi tin nhắn qua email hoặc discord.",
    "Cheers!": "Chúc mừng!",
    "Support this project": "Thích thịt chó",

    "unknown": "Không xác định",
    "original": "Chính hãng", 
    "clone": "clon", 
    "locked": "Bị khóa",
    "unlocked": "Đã mở khóa",
    "error": "Lỗi",
    "Build Date": "Ngày xây dựng",
    "HW Version": "Phiên bản phần cứng",
    "SW Version": "Phiên bản phần mềm",
    "Device Type": "Loại thiết bị",

    "Range calibration completed": "iệc hiệu chỉnh vòng ngoài cần điều khiển đã hoàn tất",
    "Range calibration failed: ": "Hiệu chỉnh vòng ngoài cần điều khiển không thành công: ",
    "Cannot unlock NVS": "Không thể mở khóa NVS", 
    "Cannot relock NVS": "Không thể khóa lại NVS", 
    "Error 1": "Lỗi 1",
    "Error 2": "Lỗi 2",
    "Error 3": "Lỗi 3",
    "Stick calibration failed: ": "Hiệu chỉnh thanh không thành công: ",
    "Stick calibration completed": "Đã hoàn tất hiệu chỉnh",
    "NVS Lock failed: ": "Khóa NVS không thành công: ",
    "NVS Unlock failed: ": "Mở khóa NVS không thành công: ",
    "Please connect only one controller at time.": "Mỗi lần chỉ có thể kết nối một bộ điều khiển.",
    "Sony DualShock 4 V1": "Sony DualShock 4 V1",
    "Sony DualShock 4 V2": "Sony DualShock 4 V2",
    "Sony DualSense": "Sony DualSense",
    "Sony DualSense Edge": "Sony DualSense Edge",
    "Connected invalid device: ": "Thiết bị kết nối không hợp lệ: ",
    "Calibration of the DualSense Edge is not currently supported.": "Hiệu chuẩn DualSense Edge hiện không được hỗ trợ.",
    "The device appears to be a DS4 clone. All functionalities are disabled.": "Thiết bị này có vẻ là DS4 lậu. Tất cả các tính năng đều bị vô hiệu hóa.",
    "Error: ": "Lỗi: ",
    "My handle on discord is: the_al": "Discord: ShuShi",
    "Initializing...": "Đang khởi tạo...",
    "Storing calibration...": "Lưu trữ hiệu chuẩn...",
    "Sampling...": "Lấy mẫu...",
    "Calibration in progress": "Đang hiệu chuẩn",
    "Start": "Bắt đầu",
    "Continue": "Tiếp tục",
    "You can check the calibration with the": "Bạn có thể kiểm tra hiệu chuẩn bằng cách",
    "Have a nice day :)": "Chúc một ngày tốt lành! :)",
    "Welcome to the Calibration GUI": "Chào mừng bạn đến với GUI hiệu chuẩn",
    "Just few things to know before you can start:": "Trước khi bắt đầu, có một số điều bạn cần biết:",
    "This website is not affiliated with Sony, PlayStation &amp; co.": "Trang web này không liên kết với Sony, PlayStation, v.v.",
    "This service is provided without warranty. Use at your own risk.": "Dịch vụ này không đi kèm với bất kỳ bảo hành nào. Sử dụng có nguy cơ của riêng bạn.",
    "Keep the internal battery of the controller connected and ensure it is well charged. If the battery dies during operations, the controller will be damaged and rendered unusable.": "Luôn kết nối pin bên trong của tay cầm và đảm bảo pin đã được sạc đầy. Nếu hết pin trong quá trình hoạt động, tay cầm sẽ bị hỏng và không thể sử dụng được.",
    "Before doing the permanent calibration, try the temporary one to ensure that everything is working well.": "Trước khi thực hiện hiệu chuẩn vĩnh viễn, hãy thử hiệu chuẩn tạm thời để đảm bảo mọi thứ đều hoạt động bình thường。/ShuShiPS.",
    "Understood": "OK. Bạn ơi",
    "Version": "Phiên bản",

    "Frequently Asked Questions": "Những câu hỏi thường gặp",
    "Close": "Đóng",
    "Welcome to the F.A.Q. section! Below, you'll find answers to some of the most commonly asked questions about this website. If you have any other inquiries or need further assistance, feel free to reach out to me directly. Your feedback and questions are always welcome!": "Chào mừng đến với phần F.A.Q! Dưới đây bạn sẽ tìm thấy câu trả lời cho một số câu hỏi thường gặp nhất về trang web này. Nếu bạn có thắc mắc gì thêm hoặc cần hỗ trợ, vui lòng liên hệ trực tiếp với tôi. Phản hồi và câu hỏi của bạn luôn được chào đón!",
    "How does it work?": "Cái này hoạt động thế nào??",
    "Behind the scenes, this website is the culmination of one year of dedicated effort in reverse-engineering DualShock controllers for fun/hobby from a random guy on the internet.": "Behind the scenes, this website is the culmination of one year of dedicated effort in reverse-engineering DualShock controllers for fun/hobby from a random guy on the internet.",
    "Through": "Bởi vì",
    "this research": "Nghiên cứu này",
    ", it was discovered that there exist some undocumented commands on DualShock controllers that can be sent via USB and are used during factory assembly process. If these commands are sent, the controller starts the recalibration of analog sticks.": ", người ta phát hiện ra rằng có một số lệnh không có trong tài liệu trên bộ điều khiển DualShock có thể được gửi qua USB và được sử dụng trong quá trình lắp ráp tại nhà máy. Nếu các lệnh này được gửi, bộ điều khiển sẽ bắt đầu hiệu chuẩn lại các thanh analog.",
    "While the primary focus of this research wasn't initially centered on recalibration, it became apparent that a service offering this capability could greatly benefit numerous individuals. And thus, here we are.": "Mặc dù trọng tâm ban đầu của nghiên cứu này không phải là hiệu chỉnh lại, nhưng rõ ràng là dịch vụ cung cấp khả năng này có thể mang lại những cải tiến đáng kể cho nhiều cá nhân. Và thế là chúng ta ở đây.",
    "Does the calibration remain effective during gameplay on PS4/PS5?": "Hiệu chỉnh vẫn hiệu quả khi chơi trên PS4/PS5?",
    "Yes, if you tick the checkbox \"Write changes permanently in the controller\". In that case, the calibration is flashed directly in the controller firmware. This ensures that it remains in place regardless of the console it's connected to.": "Có, nếu bạn chọn hộp kiểm \"Lưu thay đổi vĩnh viễn vào bộ điều khiển\". Trong trường hợp này, hiệu chuẩn được lưu trực tiếp trong phần sụn của bộ điều khiển. Điều này đảm bảo rằng nó vẫn ở đúng vị trí bất kể bảng điều khiển được kết nối.",
    "Is this an officially endorsed service?": "Đây có phải là dịch vụ được hỗ trợ chính thức không?",
    "No, this service is simply a creation by a DualShock enthusiast.": "Không, dịch vụ này chỉ đơn giản là sự sáng tạo của một người đam mê DualShock.",
    "Does this website detects if a controller is a clone?": "Trang web này có phát hiện xem bộ điều khiển có phải là bản sao không?",
    "Yes, only DualShock4 at the moment. This happened because I accidentally purchased some clones, spent time identifying the differences and added this functionality to prevent future deception.": "Có, hiện tại chỉ có DualShock4. Điều này xảy ra do tôi vô tình mua một số bản sao, dành thời gian xác định sự khác biệt và thêm chức năng này để ngăn chặn sự lừa dối trong tương lai.",
    "Unfortunately, the clones cannot be calibrated anyway, because they only clone the behavior of a DualShock4 during a normal gameplay, not all the undocumented functionalities.": "Thật không may, dù sao thì các bản sao cũng không thể được hiệu chỉnh vì chúng chỉ sao chép hoạt động của DualShock4 trong khi chơi trò chơi thông thường chứ không phải tất cả các tính năng không có giấy tờ.",
    "If you want to extend this detection functionality to DualSense, please ship me a fake DualSense and you'll see it in few weeks.": "Nếu bạn muốn mở rộng chức năng phát hiện này sang DualSense, vui lòng gửi cho tôi một DualSense giả và bạn sẽ thấy chức năng này sau vài tuần.",
    "What development is in plan?": "Có gì trong quy hoạch?",

    "I maintain two separate to-do lists for this project, although the priority has yet to be established.": "Tôi đang giữ hai danh sách việc cần làm riêng biệt cho dự án này, mặc dù mức độ ưu tiên vẫn chưa được đặt.",
    "The first list is about enhancing support for DualShock4 and DualSense controllers:": "Danh sách đầu tiên là về việc cải thiện hỗ trợ cho bộ điều khiển DualShock4 và DualSense:",
    "Implement calibration of L2/R2 triggers.": "Đã thực hiện hiệu chỉnh các nút vai L2/R2.",
    "Improve detection of clones, particularly beneficial for those seeking to purchase used controllers with assurance of authenticity.": "Cải thiện khả năng phát hiện bản sao, điều này đặc biệt có lợi cho những người muốn mua bộ điều khiển đã qua sử dụng với sự chắc chắn về tính xác thực.",
    "Enhance user interface (e.g. provide additional controller information)": "Cải thiện giao diện người dùng (ví dụ: cung cấp thêm thông tin về bộ điều khiển)",
    "Add support for recalibrating IMUs.": "Thêm hỗ trợ hiệu chỉnh lại IMU.",
    "Additionally, explore the possibility of reviving non-functioning DualShock controllers (further discussion available on Discord for interested parties).": "Ngoài ra, khả năng khôi phục bộ điều khiển DualShock không hoạt động (có thể thảo luận thêm trên Discord cho những ai quan tâm).",
    "The second list contains new controllers I aim to support:": "Danh sách thứ hai chứa các bộ điều khiển mới mà tôi muốn hỗ trợ:",
    "DualSense Edge": "DualSense Edge",
    "DualShock 3": "DualShock 3",
    "XBox Controllers": "Xbox-Controller",
    "Each of these tasks presents both immense interest and significant time investment. To provide context, supporting a new controller typically demands 6-12 months of full-time research, alongside a stroke of good fortune.": "Mỗi nhiệm vụ này mang lại cả sự quan tâm to lớn và sự đầu tư thời gian đáng kể. Để cung cấp một số bối cảnh, việc hỗ trợ bộ điều khiển mới thường cần 6-12 tháng nghiên cứu toàn thời gian, bên cạnh một vài cơ hội may mắn.",
    "I love this service, it helped me! How can I contribute?": "Tôi yêu dịch vụ này, nó đã giúp tôi! Làm thế nào tôi có thể đóng góp cho việc này?",
    "I'm glad to hear that you found this helpful! If you're interested in contributing, here are a few ways you can help me:": "Tôi rất vui khi biết rằng bạn thấy dịch vụ này hữu ích! Nếu bạn quan tâm đến việc đóng góp cho dự án, đây là một số cách bạn có thể giúp tôi:",
    "Consider making a": "Có lẽ một ",
    "donation": "Donation",
    "to support my late-night caffeine-fueled reverse-engineering efforts.": ", để hỗ trợ ca đêm kỹ thuật đảo ngược được cung cấp nhiên liệu bởi caffeine của tôi.",
    "Ship me a controller you would love to add (send me an email for organization).": "Gửi cho tôi bộ điều khiển mà bạn muốn thêm (gửi email cho tôi để sắp xếp).",
    "Translate this website in your language": "Dịch trang web sang ngôn ngữ của bạn",
    ", to help more people like you!": ", để giúp đỡ nhiều người như bạn hơn!",
    "This website uses analytics to improve the service.": "Trang web này sử dụng phân tích để cải thiện dịch vụ.",
    "Board Model": "Loại mạch",
    "This feature is experimental.": "Tính năng này đang thử nghiệm.",
    "Please let me know if the board model of your controller is not detected correctly.": "Vui lòng cho tôi biết nếu loại bảng điều khiển của bạn không được nhận dạng chính xác.",
    "Board model detection thanks to": "Công nhận loại bảng cảm ơn",
    "Please connect the device using a USB cable.": "Vui lòng kết nối thiết bị bằng cáp USB.",
    "This DualSense controller has outdated firmware.": "Bộ điều khiển DualSense này có chương trình cơ sở lỗi thời.",
    "Please update the firmware and try again.": "Vui lòng cập nhật chương trình cơ sở và thử lại.",
    "Joystick Info": "Thông tin cần điều khiển",
    "Err R:": "Lỗi R:",
    "Err L:": "Lỗi L:",
    "Check circularity": "Kiểm tra tính tuần hoàn",

    "Can I reset a permanent calibration to previous calibration?": "Bạn có thể đặt lại hiệu chuẩn vĩnh viễn về giá trị trước đó không??",
    "No.": "KHÔNG.",
    "Can you overwrite a permanent calibration?": "Bạn có thể ghi đè hiệu chuẩn vĩnh viễn không??",
    "Yes. Simply do another permanent calibration.": "Có, chỉ cần thực hiện hiệu chuẩn vĩnh viễn khác.",
    "Does this software resolve stickdrift?": "Does this software resolve stickdrift?",
    "Stickdrift is caused by a physical defect; namely dirt, worn potentiometer or in some cases a worn spring.": "Stickdrift is caused by a physical defect; namely dirt, worn potentiometer or in some cases a worn spring.",
    "This software will not fix stick drift on its own if you already experience that. What it will help with, is ensuring the new joystick(s) will function properly after replacing the old one(s) to work well with.": "Nếu bạn đã bị dính drift rồi thì phần mềm này thôi sẽ không khắc phục được. Tuy nhiên, điều nó có thể giúp ích là đảm bảo rằng cần điều khiển mới hoạt động bình thường sau khi thay thế cần điều khiển cũ.",
    "I have noticed some controllers out of the box have worse factory calibration than if I would recalibrate them. Especially true for circularity of SCUF controllers with a unique shell.": "Tôi nhận thấy rằng một số bộ điều khiển được hiệu chuẩn tại nhà máy kém hơn so với sau khi hiệu chuẩn bằng công cụ của tôi. Đặc biệt với tính tuần hoàn của bộ điều khiển SCUF với lớp vỏ độc đáo.",
    "(Dualsense) Will updating the firmware reset calibration?": "(Dualsense) Hiệu chỉnh được đặt lại trong quá trình cập nhật chương trình cơ sở?",
    "After range calibration, joysticks always go in corners.": "Sau khi hiệu chỉnh, cần điều khiển chỉ di chuyển đến các góc..",
    "This issue happens because you have clicked \"Done\" immediately after starting a range calibration.": "Điều này xảy ra vì bạn đã nhấn Xong ngay sau khi bắt đầu hiệu chỉnh.",
    "Please read the instructions.": "Vui lòng đọc hướng dẫn.",
    "You have to rotate the joysticks before you press \"Done\".": "Bạn phải xoay cần điều khiển trước khi nhấn \"Xong\"..",
    "Make sure to touch the edges of the joystick frame and rotate slowly, preferably in each direction - clockwise and anti-clockwise.": "Đảm bảo chạm vào các cạnh của khung cần điều khiển và xoay chậm, tốt nhất là theo từng hướng - theo chiều kim đồng hồ và ngược chiều kim đồng hồ.",
    "Only after you have done that, you click on \"Done\".": "Chỉ khi bạn đã thực hiện xong việc này, bạn mới nhấp vào \"Xong\".",

    "Changes saved successfully": "Lưu thay đổi thành công",
    "Error while saving changes:": "Lỗi lưu thay đổi",
    "Save changes permanently": "Lưu thay đổi vĩnh viễn",
    "Reboot controller": "Khởi động lại bộ điều khiển",

    "Controller Info": "Thông tin bộ điều khiển",
    "Debug Info": "Debug Infos",
    "Debug buttons": "Debug buttons",
    "Software": "Software",
    "Hardware": "Hardware",

    "FW Build Date": "Ngày xây dựng FW",
    "FW Type": "Loại FW",
    "FW Series": "FW Series",
    "FW Version": "",
    "FW Update": "",
    "FW Update Info": "",
    "SBL FW Version": "",
    "Venom FW Version": "",
    "Spider FW Version": "",
    "Touchpad FW Version": "",

    "Serial Number": "Serien Nummer",
    "MCU Unique ID": "",
    "PCBA ID": "",
    "Battery Barcode": "Battery Barcode",
    "VCM Left Barcode": "VCM Left Barcode",
    "VCM Right Barcode": "VCM Right Barcode",
    "HW Model": "",
    "Touchpad ID": "",
    "Bluetooth Address": "",
    "Show all": "Hiển thị tất cả",

    "": ""
}
